app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "default", "public") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    if @article.save